const yup = require("yup");

const registerSchema = yup
  .object({
    firstName: yup
      .string()
      .trim()
      .required("نام کوچک الزامی است.")
      .min(2, "نام کوچک باید حداقل ۲ کاراکتر باشد.")
      .max(50, "نام کوچک باید حداکثر ۵۰ کاراکتر باشد."),

    lastName: yup
      .string()
      .trim()
      .required("نام خانوادگی الزامی است.")
      .min(2, "نام خانوادگی باید حداقل ۲ کاراکتر باشد.")
      .max(50, "نام خانوادگی باید حداکثر ۵۰ کاراکتر باشد."),

    username: yup
      .string()
      .trim()
      .required("نام کاربری الزامی است.")
      .matches(
        /^\d{10,15}$/,
        "نام کاربری باید یک شماره معتبر بین ۱۰ تا ۱۵ رقم باشد.",
      )
      .min(10, "نام کاربری باید حداقل ۱۰ رقم باشد.")
      .max(15, "نام کاربری باید حداکثر ۱۵ رقم باشد."),

    password: yup
      .string()
      .required("رمز عبور الزامی است.")
      .min(8, "رمز عبور باید حداقل ۸ کاراکتر باشد.")
      .max(128, "رمز عبور باید حداکثر ۱۲۸ کاراکتر باشد.")
      .matches(/[a-z]/, "رمز عبور باید حداقل یک حرف کوچک داشته باشد.")
      .matches(/[A-Z]/, "رمز عبور باید حداقل یک حرف بزرگ داشته باشد.")
      .matches(/\d/, "رمز عبور باید حداقل یک عدد داشته باشد.")
      .matches(
        /[^A-Za-z0-9]/,
        "رمز عبور باید حداقل یک کاراکتر خاص داشته باشد.",
      ),
  })
  .noUnknown(true, "فیلد ناشناخته مجاز نیست.");

const loginSchema = yup
  .object({
    username: yup
      .string()
      .min(3, "نام کاربری باید حداقل 3 کاراکتر باشد.")
      .required("نام کاربری الزامی است."),
    password: yup
      .string()
      .min(6, "رمز عبور باید حداقل 6 کاراکتر باشد.")
      .required("رمز عبور الزامی است."),
  })
  .noUnknown(true, "فیلد ناشناخته مجاز نیست.");

module.exports = {
  registerSchema,
  loginSchema,
};
